main/app/views/teams/show.html.erb


        <% @team.users.each do |usr| %>
---
SELECT "users".* FROM "users"  WHERE "users"."team_id" = ?  [[nil, 1]]