main/app/views/users/show.html.erb

SELECT "teams".* FROM "teams" INNER JOIN "teams_users" ON "teams"."id" = "teams_users"."team_id" WHERE "teams_users"."user_id" = ?  [["user_id", 1]]
---
			<ul>
				<li><% @user.teams.each do |t| %></li>

SELECT "projects".* FROM "projects"  WHERE "projects"."user_id" = ?  [[nil, 1]]
---
		<p class="about-ucf">
			<% @user.projects.each do |proj| %>