main/app/controllers/blogs_controller.rb

  def create
    @bloggable = find_bloggable
    @blog = @bloggable.blogs.build(blog_params)

    #Person who creates the blog is a owner
    #@blog.users.append(current_user)
    #@user = current_user

    respond_to do |format|
      if @blog.save
---
INSERT INTO "blogs" ("content", "created_at", "title", "updated_at") VALUES (?, ?, ?, ?)  [["content", "aslkmdslv slfkmcsd"], ["created_at", "2014-06-30 18:11:05.709219"], ["title", "my blog"], ["updated_at", "2014-06-30 18:11:05.709219"]]