main/app/controllers/events_controller.rb

SELECT  "events".* FROM "events"  WHERE "events"."id" = ? LIMIT 1  [["id", 1]]
---
 	def show
 		@event = Event.friendly.find(params[:id])

INSERT INTO "events" ("category", "created_at", "description", "image_content_type", "image_file_name", "image_file_size", "image_updated_at", "infolink", "location", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
 	def create
  	@event = Event.new(event_params)
  	@event.save

SELECT  "events".* FROM "events"  WHERE "events"."id" = ? LIMIT 1  [["id", 1]]
---
  def edit
  	@event = Event.friendly.find(params[:id])

SELECT  "events".* FROM "events"  WHERE "events"."id" = ? LIMIT 1  [["id", 2]]
DELETE FROM "events" WHERE "events"."id" = ?  [["id", 2]]
---
  def destroy
  	@event = Event.friendly.find(params[:id])
   	@event.destroy

SELECT  "events".* FROM "events"  WHERE "events"."id" = ? LIMIT 1  [["id", 1]]
---
  def update
  	@event = Event.friendly.find(params[:id])