main/app/controllers/projects_controller.rb

SELECT  "projects".* FROM "projects"  WHERE "projects"."id" = ? LIMIT 1  [["id", 0]]
---
	def show
		#This page shows all the projects of a certain type (local, international, software, etc)
		@project = Project.friendly.find(params[:id])

SELECT "teams".* FROM "teams"
---
	def new
		#This page allows only privilaged users to create new projects
		@project = Project.new

		#Make teams accessible?
		@teams = Team.all

INSERT INTO "projects" ("about", "created_at", "description", "image_content_type", "image_file_name", "image_file_size", "image_updated_at", "status", "team", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
	def create
		@project = Project.new(project_params)
		@project.save

SELECT  "projects".* FROM "projects"  WHERE "projects"."id" = ? LIMIT 1  [["id", 1]]
---
	def edit
		@project = Project.friendly.find(params[:id])

SELECT  "projects".* FROM "projects"  WHERE "projects"."id" = ? LIMIT 1  [["id", 1]]
---
	def update
		@project = Project.friendly.find(params[:id])

SELECT  "projects".* FROM "projects"  WHERE "projects"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "projects" WHERE "projects"."id" = ?  [["id", 1]]
---
	def destroy
    	@project = Project.friendly.find(params[:id])
    	@project.destroy