main/app/controllers/static_pages_controller.rb

SELECT "teams".* FROM "teams"
---
	def index
		#This is where our home page goes
		@teams = Team.all