main/app/controllers/teams_controller.rb

  def create
    @team = Team.new(team_params)

    respond_to do |format|
      if @team.save
---
INSERT INTO "teams" ("created_at", "description", "name", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2014-06-29 23:39:54.893272"], ["description", "the exec board description"], ["name", "exec board"], ["updated_at", "2014-06-29 23:39:54.893272"]]

  def update
    respond_to do |format|
      if @team.update(team_params)
---
UPDATE "teams" SET "description" = ?, "updated_at" = ? WHERE "teams"."id" = 2  [["description", "sadsdkcladsnvklafmvsdvsfdvdsvdfsvsddv fdsavd s"], ["updated_at", "2014-06-30 03:38:48.663553"]]