main/app/controllers/users_controller.rb

SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    #This is the users profile page
    @user = User.friendly.find(params[:id])

SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
  def edit
    @user = User.friendly.find(params[:id])

INSERT INTO "users" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2014-06-25 15:48:29.871625"], ["updated_at", "2014-06-25 15:48:29.871625"]]
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save

UPDATE "users" SET "crypted_password" = ?, "salt" = ?, "updated_at" = ? WHERE "users"."id" = 1  [["crypted_password", "$2a$10$7cIwjYHXqcWQhSj5g0w73.4Lf6spjIVn0s3fL96F4B4yjMY4p57qy"], ["salt", "AsY2D29qRQ7VQiX5UAbR"], ["updated_at", "2014-06-30 17:43:41.759561"]]
---
  def update
    respond_to do |format|
      if @user.update(user_params)

SELECT  "users".* FROM "users"  WHERE "users"."id" = 1 LIMIT 1
---
    def set_user
      @user = User.friendly.find(params[:id])